Revit 2026 API

# NonContinuousRailInfo Properties

---

The NonContinuousRailInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Height | The height at which the non-continuous rail will be placed. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MaterialId | The material id associated with the non-continuous rail, or invalidElementId if none. |
|  | Name | The name of the non-continuous rail. |
|  | Offset | The side offset of the non-continuous rail from a [!:Autodesk::Revit::DB::Architecture::Railing] from the railing center. |
|  | ProfileId | The profile id of the non-continuous rail, or invalidElementId if none. |

#### Reference

NonContinuousRailInfo Class

Autodesk.Revit.DB.Architecture Namespace